<a href="https://colab.research.google.com/github/nadireus/Clarusway/blob/main/Pandas_Assignment2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="Rossum"></p>


____

In [76]:
import pandas as pd
import numpy as np

In [171]:
ecom = pd.read_csv('data.csv',encoding= 'unicode_escape')
ecom

       InvoiceNo StockCode  ... CustomerID         Country
0         536365    85123A  ...    17850.0  United Kingdom
1         536365     71053  ...    17850.0  United Kingdom
2         536365    84406B  ...    17850.0  United Kingdom
3         536365    84029G  ...    17850.0  United Kingdom
4         536365    84029E  ...    17850.0  United Kingdom
...          ...       ...  ...        ...             ...
541904    581587     22613  ...    12680.0          France
541905    581587     22899  ...    12680.0          France
541906    581587     23254  ...    12680.0          France
541907    581587     23255  ...    12680.0          France
541908    581587     22138  ...    12680.0          France

[541909 rows x 8 columns]

##**Check the head of the DataFrame.**

In [4]:
ecom.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

## How many rows and columns are there? **

In [5]:
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12462 entries, 0 to 12461
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    12462 non-null  object
 1   StockCode    12462 non-null  object
 2   Description  12417 non-null  object
 3   Quantity     12461 non-null  float64
 4   InvoiceDate  12461 non-null  object
 5   UnitPrice    12461 non-null  float64
 6   CustomerID   8956 non-null   float64
 7   Country      12461 non-null  object
dtypes: float64(3), object(5)
memory usage: 779.0+ KB

## Show the statistical measurements of ecom dataset **

In [91]:
ecom.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

## What is the average Purchase Price? **

In [92]:
ecom["UnitPrice"].mean()#average of unit price# ilk hesaplamada sonucla tutarsiz cikti o yÃ¼zden her tÃ¼rlÃ¼ ortalam hesapladim

4.611113626083471

In [90]:
(((ecom["UnitPrice"])*(ecom["Quantity"]).sum())/len(ecom.Description.value_counts())).mean()

5652.190179907606

In [87]:
ecom.Description.value_counts()

WHITE HANGING HEART T-LIGHT HOLDER     2369
REGENCY CAKESTAND 3 TIER               2200
JUMBO BAG RED RETROSPOT                2159
PARTY BUNTING                          1727
LUNCH BAG RED RETROSPOT                1638
                                       ...
FLAMINGO LIGHTS                           1
amazon adjust                             1
HOT WATER BOTTLE BABUSHKA LARGE           1
Wet pallet-thrown away                    1
Lighthouse Trading zero invc incorr       1
Name: Description, Length: 4223, dtype: int64

In [88]:
len(ecom.Description.value_counts())

4223

In [7]:
((ecom["UnitPrice"])*(ecom["Quantity"])).mean() #total Purchase Price average of for each material

17.34326699301878

In [93]:
((ecom["UnitPrice"])*(ecom["Quantity"])/len(ecom["Quantity"])).mean()#average of purchase price for total amount of each material

3.319338648554458e-05

In [94]:
(((ecom["UnitPrice"])*(ecom["Quantity"]))/(ecom["Quantity"].sum())).mean() #average of purchase price for  each single  material

3.474928740160054e-06

## What were the highest and lowest purchase prices? **

In [95]:
ecom["UnitPrice"].max()

38970.0

In [96]:
ecom["UnitPrice"].min()

-11062.06

## List the country names and number of records belongs to each country **

In [97]:
ecom["Country"].value_counts()

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [99]:
ecom.groupby(["Country"]).count()

                      InvoiceNo  StockCode  ...  UnitPrice  CustomerID
Country                                     ...
Australia                  1259       1259  ...       1259        1259
Austria                     401        401  ...        401         401
Bahrain                      19         19  ...         19          17
Belgium                    2069       2069  ...       2069        2069
Brazil                       32         32  ...         32          32
Canada                      151        151  ...        151         151
Channel Islands             758        758  ...        758         758
Cyprus                      622        622  ...        622         622
Czech Republic               30         30  ...         30          30
Denmark                     389        389  ...        389         389
EIRE                       8196       8196  ...       8196        7485
European Community           61         61  ...         61          61
Finland                     695        695  ...        695         695
France                     8557       8557  ...       8557        8491
Germany                    9495       9495  ...       9495        9495
Greece                      146        146  ...        146         146
Hong Kong                   288        288  ...        288           0
Iceland                     182        182  ...        182         182
Israel                      297        297  ...        297         250
Italy                       803        803  ...        803         803
Japan                       358        358  ...        358         358
Lebanon                      45         45  ...         45          45
Lithuania                    35         35  ...         35          35
Malta                       127        127  ...        127         127
Netherlands                2371       2371  ...       2371        2371
Norway                     1086       1086  ...       1086        1086
Poland                      341        341  ...        341         341
Portugal                   1519       1519  ...       1519        1480
RSA                          58         58  ...         58          58
Saudi Arabia                 10         10  ...         10          10
Singapore                   229        229  ...        229         229
Spain                      2533       2533  ...       2533        2533
Sweden                      462        462  ...        462         462
Switzerland                2002       2002  ...       2002        1877
USA                         291        291  ...        291         291
United Arab Emirates         68         68  ...         68          68
United Kingdom           495478     495478  ...     495478      361878
Unspecified                 446        446  ...        446         244

[38 rows x 7 columns]

In [98]:
records =ecom.groupby(["Country"]).count()
records.sum(axis=1)

Country
Australia                  8813
Austria                    2807
Bahrain                     131
Belgium                   14483
Brazil                      224
Canada                     1057
Channel Islands            5306
Cyprus                     4354
Czech Republic              210
Denmark                    2723
EIRE                      56661
European Community          427
Finland                    4865
France                    59833
Germany                   66465
Greece                     1022
Hong Kong                  1728
Iceland                    1274
Israel                     2032
Italy                      5621
Japan                      2506
Lebanon                     315
Lithuania                   245
Malta                       889
Netherlands               16597
Norway                     7602
Poland                     2387
Portugal                  10594
RSA                         406
Saudi Arabia                 70
Singapore                  1603
Spain                     17731
Sweden                     3234
Switzerland               13889
USA                        2037
United Arab Emirates        476
United Kingdom          3333292
Unspecified                2920
dtype: int64

In [100]:
ecom["Country"].value_counts(sort=True, ascending=True)

Saudi Arabia                10
Bahrain                     19
Czech Republic              30
Brazil                      32
Lithuania                   35
Lebanon                     45
RSA                         58
European Community          61
United Arab Emirates        68
Malta                      127
Greece                     146
Canada                     151
Iceland                    182
Singapore                  229
Hong Kong                  288
USA                        291
Israel                     297
Poland                     341
Japan                      358
Denmark                    389
Austria                    401
Unspecified                446
Sweden                     462
Cyprus                     622
Finland                    695
Channel Islands            758
Italy                      803
Norway                    1086
Australia                 1259
Portugal                  1519
Switzerland               2002
Belgium                   2069
Netherlands               2371
Spain                     2533
EIRE                      8196
France                    8557
Germany                   9495
United Kingdom          495478
Name: Country, dtype: int64

   #               ## How many records are as Country United Kingdom?

In [106]:
ecom.Country[ecom["Country"] == "United Kingdom"].value_counts()

United Kingdom    495478
Name: Country, dtype: int64

In [102]:
ecom.where(ecom["Country"] == "United Kingdom").value_counts(sort=True, ascending=True)

InvoiceNo  StockCode  Description                          Quantity  InvoiceDate       UnitPrice  CustomerID  Country
536365     21730      GLASS STAR FROSTED T-LIGHT HOLDER    6.0       12/1/2010 8:26    4.25       17850.0     United Kingdom     1
569416     22470      HEART OF WICKER LARGE                6.0       10/4/2011 10:15   2.95       13801.0     United Kingdom     1
           22284      HEN HOUSE DECORATION                 12.0      10/4/2011 10:15   1.65       13801.0     United Kingdom     1
           22283      6 EGG HOUSE PAINTED WOOD             2.0       10/4/2011 10:15   7.95       13801.0     United Kingdom     1
           22248      DECORATION  PINK CHICK MAGIC GARDEN  16.0      10/4/2011 10:15   0.85       13801.0     United Kingdom     1
                                                                                                                                ..
572344     M          Manual                               48.0      10/24/2011 10:43  1.50       14607.0     United Kingdom     6
578289     23395      BELLE JARDINIERE CUSHION COVER       1.0       11/23/2011 14:07  3.75       17841.0     United Kingdom     6
572861     22775      PURPLE DRAWERKNOB ACRYLIC EDWARDIAN  12.0      10/26/2011 12:46  1.25       14102.0     United Kingdom     8
555524     22697      GREEN REGENCY TEACUP AND SAUCER      1.0       6/5/2011 11:37    2.95       16923.0     United Kingdom    12
           22698      PINK REGENCY TEACUP AND SAUCER       1.0       6/5/2011 11:37    2.95       16923.0     United Kingdom    20
Length: 356728, dtype: int64

In [105]:
ecom[ecom["Country"] == "United Kingdom"].value_counts().sum()

361878

InvoiceNo      495478
StockCode      495478
Description    494024
Quantity       495478
InvoiceDate    495478
UnitPrice      495478
CustomerID     361878
Country        495478
dtype: int64

##** Create a column named Total which shows the total amount of spend using UnitPrice and Quantity ? **

In [172]:
ecom["Total"] =(ecom["UnitPrice"])*(ecom["Quantity"])
ecom

       InvoiceNo StockCode  ...         Country  Total
0         536365    85123A  ...  United Kingdom  15.30
1         536365     71053  ...  United Kingdom  20.34
2         536365    84406B  ...  United Kingdom  22.00
3         536365    84029G  ...  United Kingdom  20.34
4         536365    84029E  ...  United Kingdom  20.34
...          ...       ...  ...             ...    ...
541904    581587     22613  ...          France  10.20
541905    581587     22899  ...          France  12.60
541906    581587     23254  ...          France  16.60
541907    581587     23255  ...          France  16.60
541908    581587     22138  ...          France  14.85

[541909 rows x 9 columns]

##** Show total pending amount according to the Countries **

In [167]:
inf= pd.DataFrame([ecom['Total']])

In [168]:
ecom.groupby(["Country","Total"])[["Total"]].sum()

                      Total
Country     Total
Australia   -425.00 -425.00
            -262.73 -262.73
            -174.00 -174.00
            -107.50 -107.50
            -61.20   -61.20
...                     ...
Unspecified  34.00    34.00
             37.20    37.20
             44.55    44.55
             45.00    45.00
             69.36   138.72

[12498 rows x 1 columns]

##** Which Country spend least? **

In [124]:
spend=ecom.groupby(["Country"])[["Total"]].sum()
spend.sort_values(by="Total").iloc[[0]]

               Total
Country
Saudi Arabia  131.17

##** Calculate average of spending according to country with apply function? **

In [125]:
ecom.groupby('Country')[["Total"]].apply(np.mean)

                           Total
Country
Australia             108.877895
Austria                25.322494
Bahrain                28.863158
Belgium                19.773301
Brazil                 35.737500
Canada                 24.280662
Channel Islands        26.499063
Cyprus                 20.813971
Czech Republic         23.590667
Denmark                48.247147
EIRE                   32.122599
European Community     21.176230
Finland                32.124806
France                 23.069288
Germany                23.348943
Greece                 32.263836
Hong Kong              35.128611
Iceland                23.681319
Israel                 26.625657
Italy                  21.034259
Japan                  98.716816
Lebanon                37.641778
Lithuania              47.458857
Malta                  19.728110
Netherlands           120.059696
Norway                 32.378877
Poland                 21.152903
Portugal               19.333127
RSA                    17.281207
Saudi Arabia           13.117000
Singapore              39.827031
Spain                  21.624390
Sweden                 79.211926
Switzerland            28.164510
USA                     5.948179
United Arab Emirates   27.974706
United Kingdom         16.525065
Unspecified            10.649753

##** Calculate average,mean,max of spending according to country with agg function? **

In [128]:
ecom.groupby('Country')[["Total"]].agg(['mean','min','max'])

                           Total
                            mean        min        max
Country
Australia             108.877895    -425.00    1718.40
Austria                25.322494     -21.25     360.00
Bahrain                28.863158    -205.74     205.74
Belgium                19.773301     -19.95     165.00
Brazil                 35.737500      15.00     175.20
Canada                 24.280662       2.50     550.94
Channel Islands        26.499063    -293.00     408.00
Cyprus                 20.813971    -320.69     320.69
Czech Republic         23.590667     -35.76      70.80
Denmark                48.247147     -59.80     428.40
EIRE                   32.122599   -1917.00    2365.20
European Community     21.176230      -8.50      60.00
Finland                32.124806     -80.00     551.20
France                 23.069288   -8322.12    4161.06
Germany                23.348943    -599.50     876.00
Greece                 32.263836     -50.00     175.20
Hong Kong              35.128611   -2653.95    2653.95
Iceland                23.681319       5.04     249.60
Israel                 26.625657    -136.00     350.40
Italy                  21.034259     -89.55     300.00
Japan                  98.716816   -1591.20    3794.40
Lebanon                37.641778      10.20     153.00
Lithuania              47.458857      13.20     122.40
Malta                  19.728110    -130.00     455.00
Netherlands           120.059696    -266.40    4992.00
Norway                 32.378877    -376.50     700.00
Poland                 21.152903     -39.80     120.00
Portugal               19.333127   -1241.98    1241.98
RSA                    17.281207       0.00      38.25
Saudi Arabia           13.117000     -14.75      19.80
Singapore              39.827031   -3949.32    3949.32
Spain                  21.624390   -1715.85    1350.00
Sweden                 79.211926   -1188.00    1188.00
Switzerland            28.164510    -179.00     360.00
USA                     5.948179     -74.88      81.36
United Arab Emirates   27.974706       3.48     153.00
United Kingdom         16.525065 -168469.60  168469.60
Unspecified            10.649753       0.19      69.36

##** What is the max Total spending in whole dataset and show the records of that spending ?**

In [135]:
ecom[ecom['Total']==ecom["Total"].max()]

       InvoiceNo StockCode  ...         Country     Total
540421    581483     23843  ...  United Kingdom  168469.6

[1 rows x 9 columns]

##** How many people who live in Spain spend more than average Total ?**

In [141]:
ecom[(ecom.Country == "Spain") & (ecom["Total"] > (ecom['Total'].mean()))].count()

InvoiceNo      728
StockCode      728
Description    728
Quantity       728
InvoiceDate    728
UnitPrice      728
CustomerID     728
Country        728
Total          728
dtype: int64

##** Convert datatype of InvoiceDate to datetime and assign it to new column name InvoiceDate2**

In [173]:
ecom['InvoiceDate2'] =( ecom['InvoiceDate'].astype('datetime64[ns]'))
ecom.head(3)

  InvoiceNo StockCode  ...  Total        InvoiceDate2
0    536365    85123A  ...  15.30 2010-12-01 08:26:00
1    536365     71053  ...  20.34 2010-12-01 08:26:00
2    536365    84406B  ...  22.00 2010-12-01 08:26:00

[3 rows x 10 columns]

##** Take only date values (year-month-day) from InvoiceDate2 and assign it to a new column named date **

In [174]:
ecom["named_date"] = ecom["InvoiceDate2"].map(lambda ts: ts.strftime("%Y-%m-%d"))
ecom.head(3)

  InvoiceNo StockCode  ...        InvoiceDate2  named_date
0    536365    85123A  ... 2010-12-01 08:26:00  2010-12-01
1    536365     71053  ... 2010-12-01 08:26:00  2010-12-01
2    536365    84406B  ... 2010-12-01 08:26:00  2010-12-01

[3 rows x 11 columns]

##** drop InvoiceDate2 and InvoiceDate columns permanently **

In [175]:
ecom.drop(['InvoiceDate2', 'InvoiceDate'], axis = 1, inplace =True)
ecom.head(3)

  InvoiceNo StockCode  ...  Total  named_date
0    536365    85123A  ...  15.30  2010-12-01
1    536365     71053  ...  20.34  2010-12-01
2    536365    84406B  ...  22.00  2010-12-01

[3 rows x 9 columns]

##** Remove A, B, G and E from first 5 rows of ecom dataframe with a string method **

In [160]:
ecom.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 7 columns]

In [ ]:
ecom['StockCode'].iloc[0:5] = ecom['StockCode'].map(lambda x: x.rstrip('ABGE'))

In [165]:
ecom['StockCode'].iloc[0:5]

0    85123
1    71053
2    84406
3    84029
4    84029
Name: StockCode, dtype: object

## ** take only Total and date columns with loc and craete a new df named ecom2 **

In [183]:
ecom2 = ecom.loc[:, ["Total", "named_date"]]

In [180]:
ecom2.head()

   Total  named_date
0  15.30  2010-12-01
1  20.34  2010-12-01
2  22.00  2010-12-01
3  20.34  2010-12-01
4  20.34  2010-12-01

##** take only InvoiceNo and CustomerID columns with iloc and craete a new df named ecom3 **

In [184]:
ecom3= ecom.iloc[:,[0,5]]

In [185]:
ecom3.head()

  InvoiceNo  CustomerID
0    536365     17850.0
1    536365     17850.0
2    536365     17850.0
3    536365     17850.0
4    536365     17850.0

##** Combine ecom2 and ecom3 with concat **

In [189]:
pd.concat([ecom2,ecom3], axis=1,verify_integrity=True)

        Total  named_date InvoiceNo  CustomerID
0       15.30  2010-12-01    536365     17850.0
1       20.34  2010-12-01    536365     17850.0
2       22.00  2010-12-01    536365     17850.0
3       20.34  2010-12-01    536365     17850.0
4       20.34  2010-12-01    536365     17850.0
...       ...         ...       ...         ...
541904  10.20  2011-12-09    581587     12680.0
541905  12.60  2011-12-09    581587     12680.0
541906  16.60  2011-12-09    581587     12680.0
541907  16.60  2011-12-09    581587     12680.0
541908  14.85  2011-12-09    581587     12680.0

[541909 rows x 4 columns]

##** Combine ecom2 and ecom3 with merge **

In [194]:
pd.merge(ecom2,ecom3, left_index=True, right_index=True)

        Total  named_date InvoiceNo  CustomerID
0       15.30  2010-12-01    536365     17850.0
1       20.34  2010-12-01    536365     17850.0
2       22.00  2010-12-01    536365     17850.0
3       20.34  2010-12-01    536365     17850.0
4       20.34  2010-12-01    536365     17850.0
...       ...         ...       ...         ...
541904  10.20  2011-12-09    581587     12680.0
541905  12.60  2011-12-09    581587     12680.0
541906  16.60  2011-12-09    581587     12680.0
541907  16.60  2011-12-09    581587     12680.0
541908  14.85  2011-12-09    581587     12680.0

[541909 rows x 4 columns]

##** Combine ecom2 and ecom3 with join **

In [203]:
ecom2.join(ecom3,lsuffix ="_left")

        Total  named_date InvoiceNo  CustomerID
0       15.30  2010-12-01    536365     17850.0
1       20.34  2010-12-01    536365     17850.0
2       22.00  2010-12-01    536365     17850.0
3       20.34  2010-12-01    536365     17850.0
4       20.34  2010-12-01    536365     17850.0
...       ...         ...       ...         ...
541904  10.20  2011-12-09    581587     12680.0
541905  12.60  2011-12-09    581587     12680.0
541906  16.60  2011-12-09    581587     12680.0
541907  16.60  2011-12-09    581587     12680.0
541908  14.85  2011-12-09    581587     12680.0

[541909 rows x 4 columns]

# Congrats!